Revit 2027 API
DirectShapeReferenceOptions Constructor
Overload List
Name | Description
DirectShapeReferenceOptions() |  Constructs a new DirectShapeRefOptions instance with default settings.
DirectShapeReferenceOptions(DirectShapeReferenceOptions) |  Constructs a new copy of the input DirectShapeRefOptions object.
Top
See Also
Reference
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace